app/Http/Controllers/HomeController.php

    public function index()
    {
        $posts = Post::where('user_id', Auth::id())->get();
---
select * from `posts` where `user_id` = 1

    public function edit($id)
    {
        $post = Post::where('id', $id)->first();
---
select * from `posts` where `id` = '2' limit 1